Brob3rt/Kisrobot_beagyazott/Kisrobot_base/Generated_Source/PSoC5/Reg_PWM_Start.h
/*******************************************************************************
* File Name: Reg_PWM_Start.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_Reg_PWM_Start_H) /* CY_CONTROL_REG_Reg_PWM_Start_H */
#define CY_CONTROL_REG_Reg_PWM_Start_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} Reg_PWM_Start_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    Reg_PWM_Start_Write(uint8 control) ;
uint8   Reg_PWM_Start_Read(void) ;

void Reg_PWM_Start_SaveConfig(void) ;
void Reg_PWM_Start_RestoreConfig(void) ;
void Reg_PWM_Start_Sleep(void) ; 
void Reg_PWM_Start_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define Reg_PWM_Start_Control        (* (reg8 *) Reg_PWM_Start_Sync_ctrl_reg__CONTROL_REG )
#define Reg_PWM_Start_Control_PTR    (  (reg8 *) Reg_PWM_Start_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_Reg_PWM_Start_H */


/* [] END OF FILE */
